pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes_instruction_length.cpp
//---------------------------------------------------------------------------*
//                                                                           *
//         File 'pic18_intermediate_classes_instruction_length.cpp'          *
//                        Generated by version 2.4.7                         *
//                       july 6th, 2013, at 9h58'39"                         *
//                                                                           *
//---------------------------------------------------------------------------*

//--- START OF USER ZONE 1


//--- END OF USER ZONE 1

#include "pic18_intermediate_classes_instruction_length.h"
#include "galgas2/C_Compiler.h"
#include "galgas2/C_galgas_io.h"
#include "galgas2/C_galgas_CLI_Options.h"
#include "utilities/C_PrologueEpilogue.h"

//---------------------------------------------------------------------------*


//---------------------------------------------------------------------------*

#ifndef DO_NOT_GENERATE_CHECKINGS
  #define SOURCE_FILE_AT_LINE(line) "pic18_intermediate_classes_instruction_length.gSemantics", line
  #define COMMA_SOURCE_FILE_AT_LINE(line) , SOURCE_FILE_AT_LINE(line)
#else
  #define SOURCE_FILE_AT_LINE(line) 
  #define COMMA_SOURCE_FILE_AT_LINE(line) 
#endif

//---------------------------------------------------------------------------*
//                                                                           *
//Abstract category reader '@pic18_intermediate_instruction instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static TC_UniqueArray <categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_instructionLength> gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_instructionLength ;

//---------------------------------------------------------------------------*

void enterCategoryReader_instructionLength (const PMSInt32 inClassIndex,
                                            categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_instructionLength inReader) {
  gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_instructionLength.forceObjectAtIndex (inClassIndex, inReader, NULL COMMA_HERE) ;
}

//---------------------------------------------------------------------------*

static void freeCategoryReader_pic_31__38__5F_intermediate_5F_instruction_instructionLength (void) {
  gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_instructionLength.free () ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_instructionLength (NULL,
                                                                                         freeCategoryReader_pic_31__38__5F_intermediate_5F_instruction_instructionLength) ;

//---------------------------------------------------------------------------*

GALGAS_uint callCategoryReader_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                  C_Compiler * inCompiler
                                                  COMMA_LOCATION_ARGS) {
  GALGAS_uint result ;
//--- Find Reader
  if (NULL != inObject) {
    macroValidSharedObject (inObject, const cPtr_pic_31__38__5F_intermediate_5F_instruction) ;
    const C_galgas_type_descriptor * info = inObject->classDescriptor () ;
    const PMSInt32 classIndex = info->mSlotID ;
    categoryReaderSignature_pic_31__38__5F_intermediate_5F_instruction_instructionLength f = NULL ;
    if (classIndex < gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_instructionLength.count ()) {
      f = gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_instructionLength (classIndex COMMA_HERE) ;
    }
    if (NULL == f) {
       const C_galgas_type_descriptor * p = info->mSuperclassDescriptor ;
       while ((NULL == f) && (NULL != p)) {
         if (p->mSlotID < gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_instructionLength.count ()) {
           f = gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_instructionLength (p->mSlotID COMMA_HERE) ;
         }
         p = p->mSuperclassDescriptor ;
       }
       gCategoryReaderTable_pic_31__38__5F_intermediate_5F_instruction_instructionLength.forceObjectAtIndex (classIndex, f, NULL COMMA_HERE) ;
    }
    if (NULL == f) {
      fatalError ("FATAL CATEGORY READER CALL ERROR", __FILE__, __LINE__) ;
    }else{
      result = f (inObject, inCompiler COMMA_THERE) ;
    }
  }
  return result ;
}

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category reader '@pic18_intermediate_NULL instructionLength'  *
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_NULL_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                         C_Compiler * /* inCompiler */
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  result_outLength = GALGAS_uint ((PMUInt32) 0U) ;
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_NULL_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_NULL.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_NULL_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_NULL_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_NULL_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_pseudo_ORG instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                  C_Compiler * /* inCompiler */
                                                                                                  COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  result_outLength = GALGAS_uint ((PMUInt32) 0U) ;
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_pseudo_5F_ORG_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_pseudo_LABEL instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

