pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes_instruction_length.cpp
static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                    C_Compiler * /* inCompiler */
                                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  result_outLength = GALGAS_uint ((PMUInt32) 0U) ;
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_pseudo_5F_LABEL_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category reader '@pic18_intermediate_word instructionLength'  *
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_word_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                         C_Compiler * /* inCompiler */
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  result_outLength = GALGAS_uint ((PMUInt32) 2U) ;
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_word_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_word.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_word_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_word_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_word_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_actualInstruction instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_actualInstruction_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                      C_Compiler * /* inCompiler */
                                                                                                      COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  result_outLength = GALGAS_uint ((PMUInt32) 2U) ;
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_actualInstruction_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_actualInstruction.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_actualInstruction_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_actualInstruction_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_actualInstruction_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_MOVFF instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                         C_Compiler * /* inCompiler */
                                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  result_outLength = GALGAS_uint ((PMUInt32) 4U) ;
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_MOVFF_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_conditionalBranch instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                     C_Compiler * /* inCompiler */
                                                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch) ;
  if (object->mAttribute_mBranchMode.isValid ()) {
    switch (object->mAttribute_mBranchMode.enumValue ()) {
    case GALGAS_condionalBranchMode::kNotBuilt:
      break ;
    case GALGAS_condionalBranchMode::kEnum_native: {
      result_outLength = GALGAS_uint ((PMUInt32) 2U) ;
      } break ;
    case GALGAS_condionalBranchMode::kEnum_ipicNative: {
      result_outLength = GALGAS_uint ((PMUInt32) 2U) ;
      } break ;
    case GALGAS_condionalBranchMode::kEnum_ipicBRA: {
      result_outLength = GALGAS_uint ((PMUInt32) 4U) ;
      } break ;
    case GALGAS_condionalBranchMode::kEnum_ipicGOTO: {
      result_outLength = GALGAS_uint ((PMUInt32) 6U) ;
      } break ;
    }
  }
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_instructionLength) ;
}

//---------------------------------------------------------------------------*

