pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes_instruction_length.cpp
C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_conditionalBranch_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category reader '@pic18_intermediate_JUMP instructionLength'  *
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_JUMP_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                         C_Compiler * /* inCompiler */
                                                                                         COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_JUMP * object = (const cPtr_pic_31__38__5F_intermediate_5F_JUMP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JUMP) ;
  if (object->mAttribute_mKind.isValid ()) {
    switch (object->mAttribute_mKind.enumValue ()) {
    case GALGAS_jumpInstructionKind::kNotBuilt:
      break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicRelative: {
      result_outLength = GALGAS_uint ((PMUInt32) 2U) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicAbsolute: {
      result_outLength = GALGAS_uint ((PMUInt32) 4U) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_relative: {
      result_outLength = GALGAS_uint ((PMUInt32) 2U) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_absolute: {
      result_outLength = GALGAS_uint ((PMUInt32) 4U) ;
      } break ;
    }
  }
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_JUMP_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JUMP.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_JUMP_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_JUMP_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_JUMP_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//  Overriding category reader '@pic18_intermediate_JSR instructionLength'   *
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_JSR_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                        C_Compiler * /* inCompiler */
                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_JSR * object = (const cPtr_pic_31__38__5F_intermediate_5F_JSR *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_JSR) ;
  if (object->mAttribute_mKind.isValid ()) {
    switch (object->mAttribute_mKind.enumValue ()) {
    case GALGAS_jumpInstructionKind::kNotBuilt:
      break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicRelative: {
      result_outLength = GALGAS_uint ((PMUInt32) 2U) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_ipicAbsolute: {
      result_outLength = GALGAS_uint ((PMUInt32) 4U) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_relative: {
      result_outLength = GALGAS_uint ((PMUInt32) 2U) ;
      } break ;
    case GALGAS_jumpInstructionKind::kEnum_absolute: {
      result_outLength = GALGAS_uint ((PMUInt32) 4U) ;
      } break ;
    }
  }
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_JSR_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_JSR.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_JSR_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_JSR_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_JSR_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_LFSR instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * /* inObject */,
                                                                                                        C_Compiler * /* inCompiler */
                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  result_outLength = GALGAS_uint ((PMUInt32) 4U) ;
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_LFSR_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_MNOP instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

