pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes_instruction_length.cpp
static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                        C_Compiler * inCompiler
                                                                                                        COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP) ;
  result_outLength = object->mAttribute_mOccurrenceFactor.reader_uint (SOURCE_FILE_AT_LINE (92)).multiply_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (92)) ;
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_MNOP_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_computed_retlw instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                     C_Compiler * inCompiler
                                                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw) ;
  result_outLength = object->mAttribute_mLiteralValues.reader_length (SOURCE_FILE_AT_LINE (99)).multiply_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (99)).add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (99)) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.operator_not (SOURCE_FILE_AT_LINE (100)).boolEnum () ;
  if (kBoolTrue == test_0) {
    result_outLength = result_outLength.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (101)) ;
  }
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_retlw_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_computed_bra instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                   C_Compiler * inCompiler
                                                                                                                   COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra) ;
  result_outLength = object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (109)).multiply_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (109)).add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (109)) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.operator_not (SOURCE_FILE_AT_LINE (110)).boolEnum () ;
  if (kBoolTrue == test_0) {
    result_outLength = result_outLength.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (111)) ;
  }
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_bra_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_computed_goto instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

