pierremolinaro/piccolo-dev/galgas_sources/GALGAS_OUTPUT/pic18_intermediate_classes_instruction_length.cpp
static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                    C_Compiler * inCompiler
                                                                                                                    COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto) ;
  result_outLength = object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (119)).multiply_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (119)).add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (119)) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.operator_not (SOURCE_FILE_AT_LINE (120)).boolEnum () ;
  if (kBoolTrue == test_0) {
    result_outLength = result_outLength.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (121)) ;
  }
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_goto_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_instruction_computed_rcall instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                     C_Compiler * inCompiler
                                                                                                                     COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall * object = (const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall) ;
  result_outLength = object->mAttribute_mTargetLabels.reader_length (SOURCE_FILE_AT_LINE (129)).multiply_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (129)) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesRCALL.operator_not (SOURCE_FILE_AT_LINE (130)).boolEnum () ;
  if (kBoolTrue == test_0) {
    result_outLength = result_outLength.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (131)) ;
  }
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_instruction_5F_computed_5F_rcall_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_incDecRegisterInCondition instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                              C_Compiler * /* inCompiler */
                                                                                                              COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition) ;
  const enumGalgasBool test_0 = object->mAttribute_mUsesBra.boolEnum () ;
  if (kBoolTrue == test_0) {
    result_outLength = GALGAS_uint ((PMUInt32) 4U) ;
  }else if (kBoolFalse == test_0) {
    result_outLength = GALGAS_uint ((PMUInt32) 6U) ;
  }
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_incDecRegisterInCondition_instructionLength, NULL) ;

//---------------------------------------------------------------------------*
//                                                                           *
//Overriding category reader '@pic18_intermediate_registerComparisonCondition instructionLength'*
//                                                                           *
//---------------------------------------------------------------------------*

static GALGAS_uint categoryReader_pic_31__38__5F_intermediate_5F_registerComparisonCondition_instructionLength (const cPtr_pic_31__38__5F_intermediate_5F_instruction * inObject,
                                                                                                                C_Compiler * inCompiler
                                                                                                                COMMA_UNUSED_LOCATION_ARGS) {
  GALGAS_uint result_outLength ; // Returned variable
  const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition * object = (const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) inObject ;
  macroValidSharedObject (object, const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition) ;
  GALGAS_bool var_usesIntermediateBRA ;
  //--- @selfCopyInExpressionForGeneration
  const GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition temp_0 = object ;
  callCategoryMethod_usesIntermediateBRA ((const cPtr_pic_31__38__5F_intermediate_5F_registerComparisonCondition *) temp_0.ptr (), var_usesIntermediateBRA, inCompiler COMMA_SOURCE_FILE_AT_LINE (165)) ;
  const enumGalgasBool test_1 = var_usesIntermediateBRA.boolEnum () ;
  if (kBoolTrue == test_1) {
    result_outLength = GALGAS_uint ((PMUInt32) 4U) ;
  }else if (kBoolFalse == test_1) {
    result_outLength = GALGAS_uint ((PMUInt32) 2U) ;
  }
  const enumGalgasBool test_2 = object->mAttribute_mUsesBra.boolEnum () ;
  if (kBoolTrue == test_2) {
    result_outLength = result_outLength.add_operation (GALGAS_uint ((PMUInt32) 2U), inCompiler COMMA_SOURCE_FILE_AT_LINE (172)) ;
  }else if (kBoolFalse == test_2) {
    result_outLength = result_outLength.add_operation (GALGAS_uint ((PMUInt32) 4U), inCompiler COMMA_SOURCE_FILE_AT_LINE (174)) ;
  }
//---
  return result_outLength ;
}


//---------------------------------------------------------------------------*

static void defineCategoryReader_pic_31__38__5F_intermediate_5F_registerComparisonCondition_instructionLength (void) {
  enterCategoryReader_instructionLength (kTypeDescriptor_GALGAS_pic_31__38__5F_intermediate_5F_registerComparisonCondition.mSlotID,
                                         categoryReader_pic_31__38__5F_intermediate_5F_registerComparisonCondition_instructionLength) ;
}

//---------------------------------------------------------------------------*

C_PrologueEpilogue gReader_pic_31__38__5F_intermediate_5F_registerComparisonCondition_instructionLength (defineCategoryReader_pic_31__38__5F_intermediate_5F_registerComparisonCondition_instructionLength, NULL) ;

//--- START OF USER ZONE 2


//--- END OF USER ZONE 2


